Revit 2024 API
ScheduleField.MultipleValuesDisplayType Property
 Determines the type of multiple value indication to be used when the schedule field displays multiple element values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public ScheduleFieldMultipleValuesDisplayType MultipleValuesDisplayType { get; set; }
Visual Basic
Public Property MultipleValuesDisplayType As ScheduleFieldMultipleValuesDisplayType
	Get
	Set
Visual C++
public:
property ScheduleFieldMultipleValuesDisplayType MultipleValuesDisplayType {
	ScheduleFieldMultipleValuesDisplayType get ();
	void set (ScheduleFieldMultipleValuesDisplayType value);
}
Remarks
 The default display type is Project, indicating that the project [!:Autodesk::Revit::DB::MultipleValuesIndicationSettings::Value] setting will be used.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace